Repository: shaherm2025-a11y/frontend_for_mobile
Catalog: lib/l10n/app_*.arb
Languages: ar

# welcomeText
source: Welcome to the Plant Diagnosis App!
ar: مرحبًا بك في تطبيق تشخيص النباتات!

source: Diagnose Plant
ar: تشخيص النبات

source: Contact Experts
ar: التواصل مع الخبراء

source: Our Products
ar: منتجاتنا

# awarenessGuide
source: Agricultural Awareness
ar: دليل التوعية

source: Change Language
ar: تغيير اللغة

source: Plant Diagnosis
ar: تشخيص النبات

# selectImage
source: Select an image
ar: اختر صورة

# result
source: Diagnosis
ar: النتيجة

source: Treatment
ar: العلاج

source: Experts
ar: الخبراء

# expertsPlaceholder
source: Expert support will be available soon.
ar: دعم الخبراء سيتوفر قريبًا.

# productsPlaceholder
source: Products list coming soon.
ar: قائمة المنتجات ستتوفر قريبًا.

# awarenessPlaceholder
source: Awareness content will be added.
ar: سيتم إضافة محتوى توعوي لاحقًا.

source: Basic Farming
ar: أساسيات الزراعة

# soilAdvice
source: • Choose the right soil: Test every 2 years.
ar: • اختيار التربة المناسبة: تحليلها كل عامين.

# sunAdvice
source: • Ensure sunlight exposure: 6-8 hours daily.
ar: • تعرض النبات للشمس: 6-8 ساعات يوميًا.

# wateringAdvice
source: • Water regularly: When top 2–3 cm of soil is dry.
ar: • الري المنتظم: عند جفاف التربة 2-3 سم.

# diseasePrevention
source: Plant Disease Prevention
ar: الوقاية من أمراض النبات

# toolSanitation
source: • Disinfect tools before planting.
ar: • تعقيم الأدوات قبل الزراعة.

# cropRotation
source: • Practice crop rotation yearly.
ar: • ممارسة الدورة الزراعية.

# seedSelection
source: • Use certified healthy seeds.
ar: • استخدام بذور سليمة وموثوقة.

source: Natural Pest Control
ar: مكافحة الآفات طبيعيًا

# plantRepellents
source: • Grow pest-repelling plants (e.g., mint, basil).
ar: • زراعة نباتات طاردة (نعناع، ريحان).

# organicSprays
source: • Use organic sprays like neem oil.
ar: • استخدام بخاخات عضوية مثل زيت النيم.

# beneficialInsects
source: • Encourage beneficial insects (e.g., ladybugs).
ar: • تشجيع وجود الحشرات النافعة.

# commonDiseases
source: Common Plant Diseases and Treatment
ar: الأمراض الشائعة وطرق العلاج

source: Disease
ar: المرض

source: Symptoms
ar: الأعراض

# seasonalTips
source: Seasonal Farming Tips
ar: نصائح موسمية

source: Spring
ar: الربيع

source: Summer
ar: الصيف

source: Autumn
ar: الخريف

source: Winter
ar: الشتاء

# spring1
source: Prune flowering plants.
ar: تقليم النباتات المزهرة.

# spring2
source: Add organic compost.
ar: إضافة السماد العضوي.

# summer1
source: Water early in the morning.
ar: الري في الصباح الباكر.

# summer2
source: Use mulch to retain moisture.
ar: استخدام المهاد للحفاظ على الرطوبة.

# autumn1
source: Plant winter crops.
ar: زراعة المحاصيل الشتوية.

# autumn2
source: Clean up old crop residues.
ar: تنظيف الحديقة من بقايا المحاصيل.

# winter1
source: Protect sensitive plants with greenhouses.
ar: حماية النباتات الحساسة بالصوبات.

# winter2
source: Reduce watering to avoid root rot.
ar: تقليل الري لتفادي التعفن.

# resources
source: Trusted Resources
ar: مصادر موثوقة

# youtubeChannels
source: • YouTube channels: 'Garden Answer', 'Epic Gardening'
ar: • قنوات زراعة على يوتيوب: زراعة بلكونة، مهندس زراعي

source: Need Help?
ar: هل تحتاج مساعدة؟

# contactExpertsInfo
source: • Use the 'Contact Experts' feature in the app.
ar: • استخدم ميزة 'التواصل مع الخبراء' داخل التطبيق.

source: Powdery mildew
ar: البياض الدقيقي

# powderyMildewSymptoms
source: White layer on leaves
ar: طبقة بيضاء على الأوراق

# powderyMildewTreatment
source: Good ventilation + sulfur spray
ar: تهوية جيدة + رش بالكبريت

source: Late blight
ar: اللفحة المتأخرة

# lateBlightSymptoms
source: Black spots on tomatoes
ar: بقع سوداء على الطماطم

# lateBlightTreatment
source: Copper fungicide + remove infected
ar: مبيد نحاسي + إزالة المصاب

# pick_camera
source: Pick from Camera
ar: التقط صورة

source: Confidence
ar: الدقة

source: Root rot
ar: التعفن الجذري

# rootRotSymptoms
source: Yellowing and gradual death
ar: اصفرار وموت تدريجي

# rootRotTreatment
source: Improve drainage + reduce watering
ar: تحسين التصريف + تقليل الري

source: Aphids
ar: المن

# aphidsSymptoms
source: Small insects sucking sap
ar: حشرات صغيرة تمتص العصارة

# aphidsTreatment
source: Neem spray + soap water
ar: بخاخ النيم + ماء وصابون

# takephoto
source: Take an image
ar: الكاميرا

# selectimages
source: Select Image
ar: اختيار صورة

source: scab
ar: جرب النبات

# scab_treatment
source: Use resistant varieties, apply fungicides, and prune infected leaves.
ar: استخدم أصناف مقاومة، رش المبيدات الفطرية، واقص الأوراق المصابة. ملاحظة: للتأكد من دقة وسلامة التشخيص يرجى الرجوع إلى صفحة الخبراء.

source: Black Rot
ar: العفن الاسود

# black_rot_treatment
source: Remove infected parts, apply fungicides, and ensure good ventilation.
ar: إزالة الثمار الجافة، استخدام مبيدات فطرية، وتحسين التهوية. Thiofluzamid 30% SC+Methyl ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: Cedar Rust
ar: صداء الارز

# cedar_rust_treatment
source: Remove nearby cedar trees, use resistant cultivars, and apply fungicides.
ar: إزالة أشجار الأرز المجاورة، استخدام أصناف مقاومة، ورش مبيدات. ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

# healthy
source: Healthy plant
ar: نباتات سليم ملاحظة: للتأكد من دقة وسلامة التشخيص يرجى الرجوع إلى صفحة الخبراء.

source: Powdery Mildew
ar: البياض الدقيقي

# powdery_mildew_treatment
source: Apply sulfur-based fungicides, prune affected parts, and ensure proper spacing.
ar: رش الكبريت، تقليم الأجزاء المصابة، وتوفير مسافات مناسبة. 1- كبريت مكروني (كوزافيت)+ ماكسفون 2- كربندازيم (بريمو + الصاخب) 3- ازوكسي استر وبين (القوس+ادريس) 4- مايكلوبيوتانيل ( كاربتار+ الهرم ) ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: Gray Leaf Spot
ar: تبقع أوراق الذرة الرمادي

# gray_leaf_spot_treatment
source: Use resistant hybrids, rotate crops, and apply fungicides.
ar: زراعة أصناف مقاومة، تناوب المحاصيل، واستخدام المبيدات الفطرية. pyroclostrobin + dimethomorph ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

# common_rust
source: Corn Common Rust
ar: الصداء الشائع

# common_rust_treatment
source: Plant resistant varieties, monitor crops, and apply fungicides if severe. difenoconazol
ar: زراعة أصناف مقاومة، متابعة الحقل، واستخدام مبيدات عند الحاجة. difenoconazol ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: Northern Leaf Blight
ar: لفحة الاوراق الشمالية

# northern_leaf_blight_treatment
source: Rotate crops, apply fungicides, and avoid continuous corn planting.
ar: تناوب المحاصيل، استخدام المبيدات، وتجنب الزراعة المستمرة للذرة. ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

# esca
source: Esca (Black Measles)
ar: إسكا (الحصبة السوداء)

# esca_treatment
source: Prune infected vines, avoid wounding, and remove diseased plants.
ar: تقليم الكروم المصابة، تجنب الجروح، وإزالة النباتات المريضة. ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: Leaf Blight
ar: لفحة الاوراق

# leaf_blight_treatment
source: Use fungicides and remove infected leaves.
ar: استخدام المبيدات وإزالة الأوراق المصابة. coppe oxychlorid 39.75 + cymoxanil 4.3% WP ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

# bacrerial_spot
source: Bacterial Spot
ar: تبقع بكتيري

# bacrerial_spot_treatment
source: Apply copper sprays and use resistant varieties.
ar: رش النحاس، استخدام أصناف مقاومة. ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: Early Blight
ar: اللفحةالمبكرة

# early_blight_treatment
source: Use resistant varieties, rotate crops, and apply fungicides.
ar: إزالة الأوراق المصابة، تناوب المحاصيل، واستخدام المبيدات ازوكسيستروبين +دايفنكونازول (ماكسفون + الفظول ) كربندازيم ( بريمو +الصاخب ابروديون (ريد ور) ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: Late Blight
ar: اللفحةالمتاخرة

# late_blight_treatment
source: Destroy infected plants, avoid overhead watering, and apply fungicides.
ar: إتلاف النباتات المصابة، تجنب الري العلوي، واستخدام المبيدات. و تنص التوصيات على عدم تكرار الرش لاكثر من رشتين خلال الموسم ثم يتم تغير الي مبيد اخر ( 1- ميتالاكسيل +نحاس 2- سيموكاسنيل + نحاس 3- فاموكسادون 4- بروباموكارب هيدروكلورايد 5- ميتالاكسيل +دينيكونازول ) ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: Leaf Mold
ar: عفن الاوراق

# leaf_mold_treatment
source: Provide ventilation, avoid overhead watering, and use fungicides.
ar: تحسين التهوية، تجنب الري العلوي، واستخدام المبيدات. ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

# tomato_septoria_leaf_spot
source: Septoria Leaf Spot
ar: تبقع الاوراق (سبتوريا)

# tomato_septoria_leaf_spot_treatment
source: Rotate crops, remove infected leaves, and apply fungicides.
ar: تناوب المحاصيل، إزالة الأوراق المصابة، ورش المبيدات. ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: Spider Mites
ar: العناكب الحمراء

# spider_mites_treatment
source: Spray miticides, encourage natural predators, and irrigate properly.
ar: تشجيع الأعداء الحيوية، والري الجيد رش مبيدات ، .1- ابامكتين +بيردابين (ميشال) 2- ابامكتين (سلو مكتين) 3- بيردابين (دبون _فاكرون _ترمنتك ) ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: Target Spot
ar: تبقع الهدف

# target_spot_treatment
source: Use fungicides and remove infected plant debris.
ar: استخدام المبيدات وإزالة بقايا النباتات المصابة. ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

# yellow_leaf_curl
source: Yellow Leaf Curl Virus
ar: فيروس تجعد ألاوراق الصفراء

# yellow_leaf_curl_treatment
source: Control whiteflies, use resistant varieties, and apply neem oil.
ar: مكافحة الذباب الأبيض، زراعة أصناف مقاومة، واستخدام زيت النيم. ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: Mosaic Virus
ar: فيروس موزاييك

# mosaic_virus_treatment
source: Remove infected plants, disinfect tools, and control aphids.
ar: إزالة النباتات المصابة، تعقيم الأدوات، ومكافحة المن. ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

# orange_hlb
source: Orange Citrus Greening (HLB)
ar: التدهور السريع (HLB) في البرتقال

# orange_hlb_treatment
source: Control psyllid insects, remove infected trees, and use resistant rootstocks.
ar: مكافحة حشرة البسيلا، إزالة الأشجار المصابة، واستخدام أصول مقاومة. ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: Strawberry Leaf Scorch
ar: احتراق أوراق الفراولة

# strawberry_leaf_scorch_treatment
source: Remove infected leaves, irrigate properly, and apply fungicides.
ar: إزالة الأوراق المصابة، الري المناسب، واستخدام المبيدات. ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: algal
ar: الصدأ الطحلبي الأحمر

# algal_treatment
source: 1. Remove the infected parts – prune the heavily infected branches – remove the severely damaged leaves – dispose of them outside the farm.
ar: 1. إزالة الأجزاء المصابة - قص الفروع الشديدة الإصابة - إزالة الأوراق المتضررة جدًا - التخلص منها خارج المزرعة ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: Anthracnose
ar: لفحة الأنثراكنوز

# anthracnose_treatment
source: 1- Remove infected leaves and branches 2- Improve air circulation 3- Avoid overhead irrigation Cymoxanil 30%+famoxadon 22%WG
ar: إزالة الأوراق والفروع المصابة - تحسين التهوية وتقليل الرطوبة - تجنب الري على الأوراق و استخدام ( 1- كربندازيم (بريمو) 2- كوبراوكسي كلوبرايد 3- ازكي استروبين (اديس)) Cymoxanil 30%+famoxadon 22%WG ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: Brown Blight
ar: التبقع البني

# brown_blight_treatment
source: - Remove severely infected parts - Reduce humidity - Increase ventilation
ar: إزالة الأجزاء شديدة الإصابة - تقليل الرطوبة - تعزيز التهوية واستخدام (1- ابروديون (ريدور) 2- كربندازيم (بريمو)) ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: Gray Blight
ar: اللفحة الرماديةأو التبقع الرمادي

# gray_blight_treatment
source: - Remove infected leaves - Improve ventilation and avoid excessive irrigation - Clean plant debris around the base
ar: - إزالة الأوراق المصابة - تحسين التهوية وتقليل الري الزائد - تنظيف بقايا النبات حول الجذع ملاحظة: للتأكد من دقة وسلامة التشخيص يمكنك الرجوع إلى صفحة الخبراء.

source: Diagnosis failed
ar: فشل التشخيص.

source: Pests & Diseases
ar: الآفات والأمراض

# pestsDiseases1
source: Pests and Diseases
ar: الآفات والأمراض

source: Select Crop
ar: اختر المحصول

# noCropSelected
source: Please select a crop
ar: الرجاء اختيار محصول

source: Stage
ar: مرحلة

# noDiseases
source: No diseases found
ar: لا توجد أمراض

source: Disease Details
ar: تفاصيل المرض

source: Cause
ar: الأسباب

source: Preventive Measures
ar: الإجراءات الوقائية

source: Chemical Treatment
ar: المكافحة الكيميائية

source: Alternative Treatment
ar: المكافحة العضوية

# appTitle
source: Plant Diagnosis
ar: تشخيص النبات

source: Awareness
ar: التوعية

source: About App
ar: حول التطبيق

# selectCropFirst
source: Please select a crop first
ar: الرجاء اختيار المحصول أولاً

# noDiseasesFound
source: No diseases found for this stage
ar: لا توجد أمراض لهذه المرحلة

source: Select Stage
ar: اختر المرحلة

source: Causes
ar: الأسباب

source: Loading...
ar: جاري التحميل...

# errorLoadingData
source: An error occurred while loading data
ar: حدث خطأ أثناء تحميل البيانات.

source: Try Again
ar: إعادة المحاولة

# noPreviousDiagnoses
source: No items to display currently
ar: لا توجد عناصر لعرضها حاليًا

# previousDiagnos
source: Previous Diagnoses
ar: التشخيصات السابقة

# farmer_page_title
source: Farmer Questions
ar: أسئلة المزارعين

# tab_unanswered
source: unanswerd question
ar: الاستشارات التي لم يتم الرد عليها

# tab_answered
source: answerd question
ar: الاستشارات التي تم الرد عليها

# previousQuestions
source: Answered Questions
ar: الأسئلة المجابة سابقًا

source: Pending Questions
ar: الأسئلة قيد الانتظار

# label_write_question
source: Write your question here
ar: اكتب السؤال هنا

# button_pick_image
source: Pick an Image
ar: اختر صورة

# button_send_question
source: Send Question
ar: إرسال السؤال

# snackbar_question_sent
source: Your question has been sent successfully!
ar: تم إرسال السؤال ✅

# label_question
source: Question:
ar: السؤال:

# label_answer
source: Answer:
ar: الإجابة:
